package com.company;
//Задача №8: Цикличный вывод данных на экран
//Необходимо с помощью цикла вывести на экран числа от 1 до 50.
public class cicle {

    public static void main(String[] args) {

        for (int i = 1; i < 51; i++) {
            System.out.println(i);
        }
    }
}
